#!/bin/bash

# Назва віртуального середовища
VENV_NAME=".venv"

echo "⚙️ Створення/активація віртуального середовища..."
if [ ! -d "$VENV_NAME" ]; then
    python3 -m venv "$VENV_NAME"
fi

source "$VENV_NAME/bin/activate"

echo "📦 Встановлення залежностей з requirements.txt..."
pip install -r requirements.txt

# Створення бази даних та тестових користувачів
echo "💾 Ініціалізація бази даних..."
python3 database/init_db.py

echo "✅ Налаштування завершено. Для запуску бота використовуйте команду: source $VENV_NAME/bin/activate && python3 telegram_bot/bot.py"
